In [1]:
import pandas as pd
import numpy as np
import os
os.getcwd()

'/Users/ugp/DSI-CHI-1/projects/weekly-projects/project-02/starter-code'

In [3]:
orders = pd.read_table ('http://bit.ly/chiporders')

In [4]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [16]:
pd.read_table ('http://bit.ly/movieusers').head()
#But we notice 2 things  1) need to seperate
#2 2)theyre counting the first row as data...so we need to instruct it that header =None

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [12]:
#so sep = '|'
#   header=none
pd.read_table ('http://bit.ly/movieusers', sep= '|', header =None).head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [17]:
# but we are going to want to have column names  
# 1) so we set up a list file called columns

user_cols = ['user_it','age','gender','zip_code']

#then we slip into NAMES, the the user_cols file. 
users = pd.read_table ('http://bit.ly/movieusers', sep= '|', header =None, names=user_cols).head()

In [18]:
users.head()

   user_it age      gender zip_code
1       24   M  technician    85711
2       53   F       other    94043
3       23   M      writer    32067
4       24   M  technician    43537
5       33   F       other    15213

In [ ]:
# Skip rows / Skip header